--------------------------------
指数基金
--------------------------------
	# 指数基金（也叫被动型基金）
		* 基金经理不主动寻求市场的表现，一般选取特定的股票作为投资对象，视图复制整个市场的平均收益。
		* 和主动型基金不同，它的风险收益不依赖基金经理，而是整个市场
		* 长期来看，相对主动型基金，被动型基金的收益更高更稳定
	
	# “指数” 和 “成分股”
		* “指数”就是一个选股规则，它按照某个规则挑选出一篮子股票
		* 由专业机构通过复杂的计算，得出一个代表这篮子股票的“平均价格”
		* 然后用这个价格来反映市场上，这一类股票的价格水平
	
		* 这个“平均价格”称为“指数点位”，篮子中的这些股票称之为这只指数的成分股

		* 指数的成分股是可以变化的，一旦某只股票不能满足原先的规则，就会被替换掉
	
	# 指数基金的特点
		* 灭绝人性(不需要经理“人”的决策，避免老鼠仓这种问题)
		* 永垂不朽(不害怕“指数”中的一些公司倒闭，因为会有新的公司补充进来，铁打的指数流水的公司)
		* 笑到最后(通过投资指数成分股获取市场持平的收益，只要经济是持续向好的，指数基金就有投资的价值)
	
	# 指数基金的风险
		* 本质还是股票型基金，异常存在风险
		* 指数基金是复制和跟踪指数，来调整篮子里面的股票组合，如果基金经理复制有偏差或者没有及时跟着调整指数，也可能带来收益方面的误差风险。
		* 指数基金的规模小或者历史不长的话，也会有风险

--------------------------------
各种指数
--------------------------------
	# A 股(简单理解为中国大陆的股票市场)市场主要的指数
		* 上证50指数
			* 上海证券市场最大，流动性最好的50只股票组成
			* 反应了沪市最具市场影响力的龙头企业的整天状况

		* 沪深300指数
			* 沪市和深市，市值排名前300的上市公司组成
			* 是国内影响力最大，最重要的指数

		* 中证500指数
			* 沪市和深市，市值排名前800的上市公司中，前300家入围了沪深300指数
			* 而剩下的500家，则组成了中证500指数，代表了中国股市中小型上市公司的平均水平
		
		* 创业板指数
			* 专门选择100家小型企业，也就是在创业板上市的公司
			* 这些公司，规模不大，盈利不够多，被主板上市的门槛挡在门外，于是退而求其次，选择在创业板上市。

		* 红利指数
			* 挑选在上证交易所上市的，现金股息率高，分红比较稳定，具有一定规模以及流动性的50只股票
			* 是A股市场真正核心优质资产

	# 港股
		* 恒生指数
			* 1964年诞生，从港股公司中选择50家具有代表性的公司股票组成的指数
			* 是香港股市价格非常重要的指标

		* H股指数
			* 被称为“恒生中国企业指数”，或“国企指数”
			* 它挑选了在香港上市的，规模最大的33家大陆企业
	
	# 美股
		* 标普500指数
			* 由美国标准普尔公司选定，代表美国股票市场的500家上市公司的指数

		* 纳斯达克指数
			* 涵盖了纳斯达克市场上所有的美国和外国公司
			* 是证券市场上非常有影响力的一只指数

	
--------------------------------
指数基金的筛选
--------------------------------