----------------------
基金分类
----------------------
	# 投资品种分类
		* 货币基金
			- 企业债
			- 银行定期存款
			- 地方政府债
			- 国债
			
			* 投资债券占比没有要求，一般都是投资短期债券，1年以内的
			* 特点：流动性高，收益稳定
			* 余额宝，就这玩意儿

		* 债券基金
			- 企业债
			- 股票
			- 地方政府债
			- 国债

			* 投资债券的占比，必须在80%以上，而且投资基本都是1年以上的债券
			* 特点：流动性低，风险略高了一点(投资了股票)，收益稳定
			* 适合投资半年，一年以内用不到的钱

		* 股票基金，股票为主，风险高收益大
			* 股票投资的占比必须在80%以上

		* 混合基金
			* 可以同时投资债券，货币 ，股票的基金，配置比例很灵活，以适应市场。从而获取最高的利益。



	# 交易渠道分类(场内外，就是证券交易市场)
		* 场内基金
			* 直接和买家/卖家交易，需要开通专门的账户
			* 场内基金价格实时变动

		* 场外基金
			* 交易的对象是基金公司，支付宝就是场外基金
			* 场外基金根据供求关系而变化

	# 运作方式分类
		* 开放式基金，基金分额不确定，总资金量大小不固定，投资者可以自由的买入买出

		* 封闭式基金，分额确定，投资者只能和其他基金持有者进行买卖

	# 投资方式分类
		* 主动形基金
			* 基金经理代替投资者进行投资，投资的股票，债券都是基金经理说了算
			* 主动出击，寻求超越平均水准的超值回报

		* 被动型基金（也叫指数基金）
			* 基金经理不主动寻求市场的表现，一般选取特定的股票作为投资对象，视图复制整个市场的平均收益
	

	# 一些基金
		* 支付宝： 货币基金/场外基金/开放式基金


----------------------
看懂基金招募说明书
----------------------
	# 这玩儿没法直接看完，太长了好几百页
	# 在基金公司官网下载《基金招募说明书》
		* 推荐在巨潮网下载
		* 在搜索框中输入： <基金代码> 招募说明书
	

	# 查看基金类型
		* 可以判断出风险程度
	
	# 基金管理人概况
		* 查看“基金管理人”和“基金托管人”，是否有啥旧的丑闻，违规违纪等等信息
		* 查看“基金经理”，考察从业时间（一般3年以上的比较靠谱）和业绩水平
	
	# 投资范围和投资策略
		* 投资的产品，以及投资的比例。
		* 基金保留的现金以及购买债券的比例（开放式基金的自由买入买出，可以依赖这笔钱）



