--------------------------------
数学运算符						|
--------------------------------
	+ - * / %

	* 原生的bash不支持数学运算,可以通过其他的命令来实现
		awk
		expr(常用)
	
--------------------------------
关系运算						|
--------------------------------
	 -eq
		* 是否相等,相等返回 true
	 -ne
		* 是否相等,不相等返回 true
	 -gt
		* 左 > 右 返回 true
	 -lt
		* 左 < 右 返回 true
	 -ge
		* 左 >= 右 返回 true
	 -le
		* 左 <= 右 返回 true
	
	*  关系运算符只支持数字,不支持字符串(除非字符串是数字,会被自动的转换)
		if [ 1 -eq "1" ] 
		then
			echo "yes"
		fi
--------------------------------
bool 运算符						|
--------------------------------	
		!
			* 非运算
		-o
			* 或(or)运算 |
		-a
			* 与(and)运算 &
	
		&& 
			* 逻辑的AND
			[[ 1 -eq 1 && 2 -eq 2 ]]

		||
			* 逻辑OR

--------------------------------
字符串运算符					|
--------------------------------
	=
		* 字符串相等,返回true
		[ "1" = "1" ]
		
	!=
		* 字符串不相等,返回true
		[ "1" != "2" ]

	-z
		* 字符串长度为0,返回true
		[ -z "" ]

	-n
		* 字符串长度不为0,返回true
		[ -n "1" ]

	str
		* 直接把字符串当作bool运算
		* 字符串非空,返回true
			[ " " ]
			[ "" ]

--------------------------------
文件运算符						|
--------------------------------
	-b
		* 是否是设备块文件
	-c
		* 是否字符串设备文件
	-d
		* 是否是目录
		[ -d "/usr/local/" ]
	-f
		* 是否是普通文件(不是目录,不是设备)
	-g
		* 是否设置了SGID
	-k
		* 是否设置了粘着位(Sticky Bit)
	-r
		* 判断文件是否可读
	-p
		* 检测文件是否具名管道
	-u
		* 是否设置了suid位
	-w
		* 是否可写
	-s
		* 文件是否为空,size=0
	-e
		*  检测文件/目录是否存在

--------------------------------
expr							|
--------------------------------
	# 表达式计算工具
	V1=1
	V2=2
	SUM=`expr $V1 + $V2`
	echo $SUM	# 3
	echo `expr ${V1} - ${V2}` # -1
	echo `expr $V1 % $V2`	# 1


